fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
// +++
// ВКМ Супонев - Дипломный проект

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВКМ_СуммаАбонентскойПлаты) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните абонентскую плату!", , "Объект.ВКМ_СуммаАбонентскойПлаты");
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ВКМ_НачалоДействияДоговора) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите дату начала действия!", , "Объект.ВКМ_НачалоДействияДоговора");
			Отказ = Истина;
		КонецЕсли;		
		
		Если Не ЗначениеЗаполнено(Объект.ВКМ_ОкончаниеДействияДоговора) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите дату окончания действия!", , "Объект.ВКМ_ОкончаниеДействияДоговора");
			Отказ = Истина;
		КонецЕсли;
		
		Если Объект.ВКМ_ОкончаниеДействияДоговора < Объект.ВКМ_НачалоДействияДоговора Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания договора не может быть раньше даты начала!", , "Объект.ВКМ_ОкончаниеДействияДоговора");
			Отказ = Истина;
		КонецЕсли;
		
		Если Объект.ВКМ_СтоимостьЧасаРаботы = 0 Тогда
    		ОбщегоНазначенияКлиент.СообщитьПользователю("Внимание: стоимость часа работы равна нулю!", , "Объект.ВКМ_СтоимостьЧасаРаботы");
		КонецЕсли;
		
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		
	ОтображениеЭлементовФормы();
	ПодстановкаШаблонаНаименованияДоговора();			//Автоформирование № договора
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтображениеЭлементовФормы()
		
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодстановкаШаблонаНаименованияДоговора()			//Автоформирование № договора

   Если Не Объект.Ссылка.Пустая() Тогда
       Возврат;
   КонецЕсли;

   СформированноеНаименование = ПолучитьНаименованиеПоШаблонуНаСервере(Объект.ВидДоговора);

   Если Не ПустаяСтрока(СформированноеНаименование) Тогда
       Объект.Наименование = СформированноеНаименование;
   КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеПоШаблонуНаСервере(Знач ВидДоговора)
	
   ДатаДляШаблона = ТекущаяДатаСеанса(); 
 
   СтрокаНомер = Формат(ДатаДляШаблона, "ДФ=yyMMdd") + "-" + Формат(ДатаДляШаблона, "ДФ=HHmm");
   
   ДатаТекстом = Формат(ДатаДляШаблона, "ДФ='dd MMMM yyyy'");

   Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
        Возврат "Договор на абонентское обслуживание № " + СтрокаНомер + " от " + ДатаТекстом + " г.";
        
   ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Покупатель") Тогда
        Возврат "Договор покупки № " + СтрокаНомер + " от " + ДатаТекстом + " г.";
        
   ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Поставщик") Тогда
        Возврат "Договор поставки № " + СтрокаНомер + " от " + ДатаТекстом + " г.";
   КонецЕсли;
   
   Возврат "";
	
КонецФункции

#КонецОбласти

// ВКМ Супонев - Дипломный проект
// +++
